/*************************************************************************
	> File Name: Fib.c
	> Author: 
	> Mail: 
	> Created Time: 2017年04月15日 星期六 10时28分29秒
 ************************************************************************/

#include<stdio.h>

int main()
{
    int i = 0;
    int a[15] = {1,1};

    for(i = 2;i < 15;i++)
    {
        a[i] = a[i-1] +a[i-2];
    }

    for(i = 0;i < 15;i++)
    {
        if(i == 5 || i == 10)
        {
            putchar(10);
        }
        printf("%d\t",a[i]);
    }

    return 0;
}
