/*************************************************************************
	> File Name: move.c
	> Author: 
	> Mail: 
	> Created Time: 2017年04月19日 星期三 19时25分56秒
 ************************************************************************/

#include<stdio.h>

int main()
{
    int i = 0;
    int j = 0;
    int a[5] = {1,2,3,4,5};

    int temp = a[0];
    for(i = 0;i < 5;++i)
    {
        a[i] = a[i+1];
    }
    a[4] = temp;

    for(i = 0;i < 5;i++)
    {
        printf("%-3d",a[i]);
    }

    return 0;
}
