/*************************************************************************
	> File Name: x.c
	> Author: 
	> Mail: 
	> Created Time: 2017年03月28日 星期二 19时18分51秒
 ************************************************************************/
//打印*塔

#include<stdio.h>

int main()
{
    int i;
    int j;
    int k;

    for(i = 0;i <= 5;i++)
    {
        for(j = 0;j < 5-i+1;j++)
        {
            printf(" ");
        }
        for(k = 0;k < 2*i-1;k++)
            {
                printf("*");
            }
        putchar(10);
    }   
}

